src/cf/Documents/ЗаданиеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаРаботу</Name>
			<BasedOn>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаданияНаРаботу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаданиеНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьМОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеВидаРабот</Name>
					<Comment>Положение вида работ (в шапке, в списке)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Сотрудники</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыОперацийЗаданиеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаданиеНаРаботу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внешнее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутреннее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ПоложениеРеквизитаНаФорме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПоложениеРеквизитаНаФорме</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВШапке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТабличнойЧасти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ЗаданиеНаРаботу/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	Возврат;
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульСозданиеНаОсновании = ОбщегоНазначения.ОбщийМодуль("СозданиеНаОсновании");
		КомандаСозданияНаОсновании = МодульСозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.ЗаданиеНаРаботу);
		Возврат КомандаСозданияНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// Изменяет состояние документов
//
// Параметры:
//  Состояние -	СправочникСсылка.СостоянияСобытий 
//  МассивОбъектов - Массив из  ДокументСсылка.ЗаданиеНаРаботу
//  ИзмененныеДокументы	 -  Массив из ДокументСсылка.ЗаданиеНаРаботу
//
Процедура УстановитьСостояние(Состояние, МассивОбъектов, ИзмененныеДокументы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документы.Ссылка КАК Ссылка,
	|	Документы.Состояние КАК Состояние
	|ИЗ
	|	Документ.ЗаданиеНаРаботу КАК Документы
	|ГДЕ
	|	Документы.Ссылка В(&Документы)";
	
	Запрос.УстановитьПараметр("Документы", МассивОбъектов);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		Если Выборка.Состояние = Состояние Тогда
			ИзмененныеДокументы.Добавить(Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Состояние = Состояние;
		
		Попытка
			ДокументОбъект.Заблокировать();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);		
		Исключение
			ИнфоОбОшибке = ИнформацияОбОшибке();
			ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнфоОбОшибке);
			ТекстОшибки = СтрШаблон(нСтр("ru='Ошибка изменения состояния %1. %2'"), Выборка.Ссылка, ПредставлениеОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Продолжить;
		КонецПопытки;
		
		ДокументОбъект.Разблокировать();
		
		ИзмененныеДокументы.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

#Область ОбработчикиОбновления

// См. ОбновлениеИнформационнойБазыУНФ.ПриДобавленииОбработчиковОбновления
//
// Параметры:
//  Параметры - Структура
//
Процедура ЗаполнитьДатаНачалаОкончания(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	ЗаданиеНаРаботуРаботы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаРаботу.Работы КАК ЗаданиеНаРаботуРаботы
	|ГДЕ
	|	ЗаданиеНаРаботуРаботы.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЗаданиеНаРаботуРаботы.Ссылка.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаданиеНаРаботуРаботы.Ссылка.Дата УБЫВ";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		ТекстСообщения = НСтр(
			"ru = 'Процедура ЗаполнитьДатаНачалаОкончания обработала все требуемые документы ""Задание на работу"".'");
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, Метаданные.Документы.ЗаданиеНаРаботу, , ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	
	ЗаданияНаРаботу = Результат.Выбрать();
	Пока ЗаданияНаРаботу.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			ПредставлениеДокумента = Строка(ЗаданияНаРаботу.Ссылка);
			ЗаданиеНаРаботуОбъект = ЗаданияНаРаботу.Ссылка.ПолучитьОбъект();
			ЗаданиеНаРаботуОбъект.Заблокировать();
			ЗаданиеНаРаботуОбъект.РассчитатьДатаНачалаОкончания();
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЗаданиеНаРаботуОбъект);
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			// Если не удалось обработать какой-либо объект, повторяем попытку снова.
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ИнфоОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
			ТекстСообщения = НСтр("ru='Не удалось обработать объект ""%1"" по причине:
			|%2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПредставлениеДокумента, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаданиеНаРаботу, ЗаданияНаРаботу.Ссылка,
				ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 Тогда
		ТекстСообщения = НСтр(
			"ru='Процедуре ЗаполнитьДатаНачалаОкончания не удалось обработать некоторые объекты (пропущены): %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ТекстСообщения = НСтр("ru='Процедура ЗаполнитьДатаНачалаОкончания обработала очередную порцию объектов: 1000'");
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, Метаданные.Документы.ЗаданиеНаРаботу, , ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДляПроведения

// Инициализирует таблицы значений, содержащие данные табличных частей документа ЗаданиеНаРаботу
// и сохраняет эти таблицы в свойствах структуры "ДополнительныеСвойства".
//
// Параметры:
//  ДокументСсылкаЗаданиеНаРаботу - ДокументСсылка.ЗаданиеНаРаботу - ссылка на документ ЗаданиеНаРаботу.
//  СтруктураДополнительныеСвойства - Структура - дополнительне свойства для проведения.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗаданиеНаРаботу, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ЗаданиеНаРаботуРаботы.ДатаНачала КАК Период,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик.Владелец
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик.Договор
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.Контрагенты
	|				ИЛИ ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ЗаданиеНаРаботуРаботы.Ссылка.Сотрудник,
	|	ЗаданиеНаРаботуРаботы.Номенклатура,
	|	ЗаданиеНаРаботуРаботы.Характеристика,
	|	ЗаданиеНаРаботуРаботы.ВидРабот,
	|	ЗаданиеНаРаботуРаботы.Трудоемкость КАК ЗагрузкаПлан,
	|	ЗаданиеНаРаботуРаботы.Сумма КАК СуммаПлан,
	|	ЗаданиеНаРаботуРаботы.Ссылка.СтруктурнаяЕдиница,
	|	ЗаданиеНаРаботуРаботы.ДатаНачала КАК ВремяНачала,
	|	ЗаданиеНаРаботуРаботы.ДатаОкончания КАК ВремяОкончания,
	|	ЗаданиеНаРаботуРаботы.Комментарий
	|ИЗ
	|	Документ.ЗаданиеНаРаботу.Работы КАК ЗаданиеНаРаботуРаботы
	|ГДЕ
	|	ЗаданиеНаРаботуРаботы.Ссылка = &Ссылка
	|	И ЗаданиеНаРаботуРаботы.Трудоемкость > 0";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаданиеНаРаботу);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗаданияНаРаботу = Результат.Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаданияНаРаботу", ТаблицаЗаданияНаРаботу);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область ИнтерфейсПечати


// Сформировать печатные формы объектов.
//
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка.ЗаданиеНаРаботу- документы, которые нужно распечатать.
//  ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//  КоллекцияПечатныхФорм - ТаблицаЗначений - Сформированные табличные документы.
//  ОбъектыПечати - Неопределено - Не используется.
//  ПараметрыВывода - Структура - Параметры сформированных табличных документов.
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаданияНаРаботу") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаданияНаРаботу", НСтр(
			"ru = 'Задание на работу'"), ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	ЭлектроннаяПочтаУНФ.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, 
		КоллекцияПечатныхФорм);
	
КонецПроцедуры  //Печать()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаданияНаРаботу";
	КомандаПечати.Представление = НСтр("ru = 'Задание на работу'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсКалендаряСотрудника

// Функция определяет пиктограмму для элемента записи календаря
//
// Параметры:
//  ЗаданиеНаРаботу	 - ДокументСсылка.ЗаданиеНаРаботу	 - задание, для записи календаря которого подбирается картинка
// 
// Возвращаемое значение:
//  Картинка - пиктограмма записи календаря
//
Функция КартинкаЗаписиКалендаря(ЗаданиеНаРаботу) Экспорт
	
	Возврат БиблиотекаКартинок.ЗадачаРазделРаботы;
	
КонецФункции

// Функция определяет цвет текста для элемента записи календаря
//
// Параметры:
//  ЗаданиеНаРаботу	 - ДокументСсылка.ЗаданиеНаРаботу	 - задание, для записи календаря которого подбирается цвет
// 
// Возвращаемое значение:
//  Цвет - цвет текста записи календаря
//
Функция ЦветТекстаЗаписиКалендаря(ЗаданиеНаРаботу) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаРаботу.Состояние.Цвет КАК СостояниеЦвет
	|ИЗ
	|	Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
	|ГДЕ
	|	ЗаданиеНаРаботу.Ссылка = &ЗаданиеНаРаботу";
	Запрос.УстановитьПараметр("ЗаданиеНаРаботу", ЗаданиеНаРаботу);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЦветСостояния = Выборка.СостояниеЦвет.Получить();
	Если ЦветСостояния = Неопределено Тогда
		ЦветСостояния = Новый Цвет;
	КонецЕсли;
	
	Возврат ЦветСостояния;
	
КонецФункции

// Процедура заполняет таблицу описаний расширенного ввода записи календаря
//
// Параметры:
//  ТаблицаОписаний - см. Справочник.ЗаписиКалендаряСотрудника
//
Процедура ПриЗаполненииРасширенногоВводаЗаписиКалендаря(ТаблицаОписаний) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаРаботу") Тогда
		
		НоваяСтрока = ТаблицаОписаний.Добавить();
		НоваяСтрока.ИмяФормы = "Документ.ЗаданиеНаРаботу.ФормаОбъекта";
		НоваяСтрока.ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ВидОперации",
			Перечисления.ВидыОперацийЗаданиеНаРаботу.Внутреннее));
		НоваяСтрока.Представление = НСтр("ru='Задание на работу: внутреннее'");
		
		НоваяСтрока = ТаблицаОписаний.Добавить();
		НоваяСтрока.ИмяФормы = "Документ.ЗаданиеНаРаботу.ФормаОбъекта";
		НоваяСтрока.ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ВидОперации",
			Перечисления.ВидыОперацийЗаданиеНаРаботу.Внешнее));
		НоваяСтрока.Представление = НСтр("ru='Задание на работу: внешнее'");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсРабочегоПроцесса

// Заполняет таблицу описания полей для рабочего процесса документа "Задание на работу".
//
// Параметры:
//  ТаблицаОписанияПолей - ТаблицаЗначений - таблица, в которую добавляются новые строки с описанием полей:
//   * ИмяРеквизита - Строка
//   * Заголовок - Строка
//   * ВариантЗаполнения - Строка
//   * ТипЗначения - ОписаниеТипов
//   * Значение - Произвольный
//   * ДополнительноеЗначение - Произвольный
//   * ОбязательноеЗаполнение - Булево
//  ТипДействия - Строка - не используется в процедуре, оставлен для совместимости с другими процедурами заполнения
//
Процедура СоставПолейЗаполненияДляРабочегоПроцесса(ТаблицаОписанияПолей, знач ТипДействия) Экспорт
	
	ЗаданиеМД = Метаданные.Документы.ЗаданиеНаРаботу;
	
	НовоеОписание = ТаблицаОписанияПолей.Добавить();
	НовоеОписание.ИмяРеквизита				= ЗаданиеМД.Реквизиты.ВидОперации.Имя;
	НовоеОписание.Заголовок					= ЗаданиеМД.Реквизиты.ВидОперации.Синоним;
	НовоеОписание.ВариантЗаполнения			= "Указанный";
	НовоеОписание.ТипЗначения				= ЗаданиеМД.Реквизиты.ВидОперации.Тип;
	НовоеОписание.Значение					= Перечисления.ВидыОперацийЗаданиеНаРаботу.Внутреннее;
	НовоеОписание.ОбязательноеЗаполнение	= Истина;
	
	НовоеОписание = ТаблицаОписанияПолей.Добавить();
	НовоеОписание.ИмяРеквизита				= ЗаданиеМД.Реквизиты.Состояние.Имя;
	НовоеОписание.Заголовок					= ЗаданиеМД.Реквизиты.Состояние.Синоним;
	НовоеОписание.ВариантЗаполнения			= "Указанный";
	НовоеОписание.ТипЗначения				= Новый ОписаниеТипов("СправочникСсылка.СостоянияСобытий");
	НовоеОписание.Значение					= Справочники.СостоянияСобытий.Запланировано;
	НовоеОписание.ОбязательноеЗаполнение	= Истина;
	
	НовоеОписание = ТаблицаОписанияПолей.Добавить();
	НовоеОписание.ИмяРеквизита				= ЗаданиеМД.Реквизиты.Сотрудник.Имя;
	НовоеОписание.Заголовок					= ЗаданиеМД.Реквизиты.Сотрудник.Синоним;
	НовоеОписание.ВариантЗаполнения			= "ИзОснования";
	НовоеОписание.ТипЗначения				= ЗаданиеМД.Реквизиты.Сотрудник.Тип;
	НовоеОписание.ОбязательноеЗаполнение	= ЗаданиеМД.Реквизиты.Сотрудник.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку;
	
	НовоеОписание = ТаблицаОписанияПолей.Добавить();
	НовоеОписание.ИмяРеквизита				= ЗаданиеМД.Реквизиты.КалендарьСотрудника.Имя;
	НовоеОписание.Заголовок					= ЗаданиеМД.Реквизиты.КалендарьСотрудника.Синоним;
	НовоеОписание.ВариантЗаполнения			= "ИзОснования";
	НовоеОписание.ТипЗначения				= ЗаданиеМД.Реквизиты.КалендарьСотрудника.Тип;
	НовоеОписание.ОбязательноеЗаполнение	= ЗаданиеМД.Реквизиты.КалендарьСотрудника.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		НовоеОписание = ТаблицаОписанияПолей.Добавить();
		НовоеОписание.ИмяРеквизита			= ЗаданиеМД.Реквизиты.Организация.Имя;
		НовоеОписание.Заголовок				= ЗаданиеМД.Реквизиты.Организация.Синоним;
		НовоеОписание.ВариантЗаполнения		= "ИзОснования";
		НовоеОписание.ТипЗначения			= ЗаданиеМД.Реквизиты.Организация.Тип;
		НовоеОписание.ОбязательноеЗаполнение= ЗаданиеМД.Реквизиты.Организация.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("УчетПоНесколькимПодразделениям") Тогда
		НовоеОписание = ТаблицаОписанияПолей.Добавить();
		НовоеОписание.ИмяРеквизита			= ЗаданиеМД.Реквизиты.СтруктурнаяЕдиница.Имя;
		НовоеОписание.Заголовок				= ЗаданиеМД.Реквизиты.СтруктурнаяЕдиница.Синоним;
		НовоеОписание.ВариантЗаполнения		= "ИзОснования";
		НовоеОписание.ТипЗначения			= ЗаданиеМД.Реквизиты.СтруктурнаяЕдиница.Тип;
		НовоеОписание.ОбязательноеЗаполнение= ЗаданиеМД.Реквизиты.СтруктурнаяЕдиница.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает массив реквизитов, недоступных для источника рабочего процесса.
//
// Параметры:
//  ТипДействия - Неопределено - Не используется в текущей реализации функции.
//
// Возвращаемое значение:
//  Массив из Строка - имена недоступных реквизитов.
//
Функция РеквизитыНедоступныеДляИсточникаРабочегоПроцесса(ТипДействия = Неопределено) Экспорт
	
	НедоступныеРеквизиты = Новый Массив;
	
	НедоступныеРеквизиты.Добавить("ПоложениеВидаРабот");
	
	Возврат НедоступныеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область ШаблоныСообщений

// Вызывается при подготовке шаблонов сообщений и позволяет переопределить список реквизитов и вложений.
//
// Параметры:
//  Реквизиты - ДеревоЗначений - список реквизитов шаблона:
//   * Имя - Строка - Уникальное имя общего реквизита.
//   * Представление - Строка - Представление общего реквизита.
//   * Тип - Тип    - Тип реквизита. По умолчанию строка.
//   * Формат - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//  Вложения - ТаблицаЗначений - печатные формы и вложения:
//   * Имя - Строка - Уникальное имя вложения
//   * Представление - Строка - Представление варианта
//   * ТипФайла - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl" и др.
//  ДополнительныеПараметры - Структура - дополнительные сведения о шаблоне сообщений.
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

// Вызывается в момент создания сообщений по шаблону для заполнения значений реквизитов и вложений.
//
// Параметры:
//  Сообщение - Структура - структура с ключами:
//    * ЗначенияРеквизитов - Соответствие из КлючИЗначение- список используемых в шаблоне реквизитов:
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * ЗначенияОбщихРеквизитов - Соответствие из КлючИЗначение - список используемых в шаблоне общих реквизитов:
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * Вложения - Соответствие из КлючИЗначение- значения реквизитов: 
//      ** Ключ     - Строка - имя вложения в шаблоне;
//      ** Значение - ДвоичныеДанные, Строка - двоичные данные или адрес во временном хранилище вложения.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект являющийся источником данных.
//  ДополнительныеПараметры - Структура -  Дополнительная информация о шаблоне сообщения.
Процедура ПриФормированииСообщения(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

// Заполняет список получателей SMS при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиSMS - ТаблицаЗначений - список получается SMS:
//     * НомерТелефона - Строка - номер телефона, куда будет отправлено сообщение SMS.
//     * Представление - Строка - представление получателя сообщения SMS.
//     * Контакт       - Произвольный - контакт, которому принадлежит номер телефона.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие из КлючИЗначение - заполненный список произвольных параметров.
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, ПредметСообщения) Экспорт
	Возврат;
КонецПроцедуры

// Заполняет список получателей письма при отправки сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиПисьма - ТаблицаЗначений - список получается письма:
//     * Адрес           - Строка - адрес электронной почты получателя.
//     * Представление   - Строка - представление получается письма.
//     * Контакт         - Произвольный - контакт, которому принадлежит адрес электронной почты.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//                                              если шаблон содержит произвольные параметры:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие из КлючИЗначение - заполненный список произвольных параметров.
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, ПредметСообщения) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область ТекущиеДела

// Обработчик заполнения текущих дел пользователя
// Параметры:
//   ТекущиеДела - см. ТекущиеДелаСервер.ТекущиеДела
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	ГруппаДел	= НСтр("ru = 'Задания на работу'");
	ИмяФормы	= "Документ.ЗаданиеНаРаботу.Форма.ФормаСписка";
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Документы.ЗаданиеНаРаботу)
		Или ТекущиеДелаСервер.ДелоОтключено(ГруппаДел) Тогда
		
		Возврат;
	КонецЕсли;
	
	ОбщиеПараметрыЗапросов = ТекущиеДелаСлужебный.ОбщиеПараметрыЗапросов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА ЗаданияНаРаботу.ДатаОкончания < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|					И ЗаданияНаРаботу.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|					И ЗаданияНаРаботу.Ссылка.Сотрудник В (&СотрудникиПользователя)
		|				ТОГДА ЗаданияНаРаботу.Ссылка
		|		КОНЕЦ) КАК ЗаданияНаРаботуПросроченоВыполнение,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА ЗаданияНаРаботу.ДатаНачала <= КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|					И ЗаданияНаРаботу.ДатаОкончания >= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|					И ЗаданияНаРаботу.Ссылка.Сотрудник В (&СотрудникиПользователя)
		|				ТОГДА ЗаданияНаРаботу.Ссылка
		|		КОНЕЦ) КАК ЗаданияНаРаботуНаСегодня,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА ЗаданияНаРаботу.Ссылка.Сотрудник В (&СотрудникиПользователя)
		|				ТОГДА ЗаданияНаРаботу.Ссылка
		|		КОНЕЦ) КАК ЗаданияНаРаботуВРаботе,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА ЗаданияНаРаботу.Ссылка.Автор = &Пользователь
		|					И НЕ ЗаданияНаРаботу.Ссылка.Сотрудник В (&СотрудникиПользователя)
		|				ТОГДА ЗаданияНаРаботу.Ссылка
		|		КОНЕЦ) КАК ЗаданияНаРаботуНаКонтроле
		|ИЗ
		|	Документ.ЗаданиеНаРаботу.Работы КАК ЗаданияНаРаботу
		|ГДЕ
		|	ЗаданияНаРаботу.Ссылка.Проведен
		|	И ЗаданияНаРаботу.Ссылка.Состояние <> ЗНАЧЕНИЕ(Справочник.СостоянияСобытий.Завершено)
		|	И ЗаданияНаРаботу.Ссылка.Состояние <> ЗНАЧЕНИЕ(Справочник.СостоянияСобытий.Отменено)";
	
	ДанныеДел = ТекущиеДелаСлужебный.ЧисловыеПоказателиТекущихДел(Запрос, ОбщиеПараметрыЗапросов);
	
	Дело = ТекущиеДела.Добавить();
	Дело.Идентификатор	 = "ЗаданияНаРаботуПросроченоВыполнение";
	Дело.ЕстьДела		= ДанныеДел.ЗаданияНаРаботуПросроченоВыполнение > 0;
	Дело.Важное			= Истина;
	Дело.Представление	= НСтр("ru = 'Просроченные'");
	Дело.Количество		= ДанныеДел.ЗаданияНаРаботуПросроченоВыполнение;
	Дело.Форма			= ИмяФормы;
	Дело.ПараметрыФормы	= Новый Структура("КлючНазначенияИспользования,ТекущиеДела,ПросроченоВыполнение", "ПросроченоВыполнение");
	Дело.Владелец		= ГруппаДел;
	Дело.Подсказка		= "";
	
	Дело = ТекущиеДела.Добавить();
	Дело.Идентификатор	= "ЗаданияНаРаботуНаСегодня";
	Дело.ЕстьДела		= ДанныеДел.ЗаданияНаРаботуНаСегодня > 0;
	Дело.Важное			= Ложь;
	Дело.Представление	= НСтр("ru = 'На сегодня'");
	Дело.Количество		= ДанныеДел.ЗаданияНаРаботуНаСегодня;
	Дело.Форма			= ИмяФормы;
	Дело.ПараметрыФормы = Новый Структура("КлючНазначенияИспользования,ТекущиеДела,НаСегодня", "НаСегодня");
	Дело.Владелец		= ГруппаДел;
	Дело.Подсказка		= "";
	
	Дело = ТекущиеДела.Добавить();
	Дело.Идентификатор	= "ЗаданияНаРаботуВРаботе";
	Дело.ЕстьДела		= ДанныеДел.ЗаданияНаРаботуВРаботе > 0;
	Дело.Важное			= Ложь;
	Дело.Представление	= НСтр("ru = 'В работе'");
	Дело.Количество		= ДанныеДел.ЗаданияНаРаботуВРаботе;
	Дело.Форма			= ИмяФормы;
	Дело.ПараметрыФормы	= Новый Структура("КлючНазначенияИспользования,ТекущиеДела,ВРаботе", "ВРаботе");
	Дело.Владелец		= ГруппаДел;
	Дело.Подсказка		= "";
	
	Дело = ТекущиеДела.Добавить();
	Дело.Идентификатор	= "ЗаданияНаРаботуНаКонтроле";
	Дело.ЕстьДела		= ДанныеДел.ЗаданияНаРаботуНаКонтроле > 0;
	Дело.Важное			= Ложь;
	Дело.Представление	= НСтр("ru = 'На контроле'");
	Дело.Количество		= ДанныеДел.ЗаданияНаРаботуНаКонтроле;
	Дело.Форма			= ИмяФормы;
	Дело.ПараметрыФормы	= Новый Структура("КлючНазначенияИспользования,ТекущиеДела,НаКонтроле", "НаКонтроле");
	Дело.Владелец		= ГруппаДел;
	Дело.Подсказка		= "";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует печатную форму документа по указанному макету.
//
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка.ЗаданиеНаРаботу - документы, для которых сформировать печатную форму.
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ИмяМакета - Строка - имя макета печатной формы. Если не указано, то используется макет "ПФ_MXL_Задание".
//
// Возвращаемое значение:
//  ТабличныйДокумент - сформированная печатная форма документа.
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета = "")
	
	ТабличныйДокумент 	= Новый ТабличныйДокумент;
	ПервыйДокумент 		= Истина;
	
	Для каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос();
		
		ТекущийДокументОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийДокумент, "Организация");
		ПараметрОрганизация = Константы.УчетПоКомпании.Компания(ТекущийДокументОрганизация);
		Запрос.УстановитьПараметр("Организация", ПараметрОрганизация);
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаРаботу.Ссылка,
		|	ЗаданиеНаРаботу.ВерсияДанных,
		|	ЗаданиеНаРаботу.ПометкаУдаления,
		|	ЗаданиеНаРаботу.Номер,
		|	ЗаданиеНаРаботу.Дата,
		|	ЗаданиеНаРаботу.Проведен,
		|	ЗаданиеНаРаботу.Организация,
		|	ЗаданиеНаРаботу.ВидОперации,
		|	ЗаданиеНаРаботу.ВидРабот КАК ВидРабот,
		|	ЗаданиеНаРаботу.ВидЦен,
		|	ЗаданиеНаРаботу.Сотрудник КАК Сотрудник,
		|	ЗаданиеНаРаботу.Сотрудник.Код КАК ТабельныйНомер,
		|	ЗаданиеНаРаботу.СтруктурнаяЕдиница КАК Подразделение,
		|	ЗаданиеНаРаботу.ПодписьМОЛ.Должность КАК ДолжностьМОЛ,
		|	ЗаданиеНаРаботу.ПодписьМОЛ.РасшифровкаПодписи КАК РасшифровкаПодписиМОЛ,
		|	СотрудникиСрезПоследних.Должность КАК Должность,
		|	ЗаданиеНаРаботу.СуммаДокумента,
		|	ЗаданиеНаРаботу.ПоложениеВидаРабот,
		|	ЗаданиеНаРаботу.Событие,
		|	ЗаданиеНаРаботу.Комментарий,
		|	ЗаданиеНаРаботу.Автор
		|ИЗ
		|	Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(, ) КАК СотрудникиСрезПоследних
		|		ПО ЗаданиеНаРаботу.Сотрудник = СотрудникиСрезПоследних.Сотрудник
		|			И (&Организация = СотрудникиСрезПоследних.Организация)
		|ГДЕ
		|	ЗаданиеНаРаботу.Ссылка = &ТекущийДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданиеНаРаботуРаботы.Ссылка,
		|	ЗаданиеНаРаботуРаботы.НомерСтроки КАК НомерСтроки,
		|	ЗаданиеНаРаботуРаботы.ВидРабот,
		|	ЗаданиеНаРаботуРаботы.Заказчик,
		|	ЗаданиеНаРаботуРаботы.Номенклатура,
		|	ЗаданиеНаРаботуРаботы.Характеристика,
		|	ЗаданиеНаРаботуРаботы.ДатаНачала КАК ДатаНачала,
		|	ЗаданиеНаРаботуРаботы.ДатаОкончания КАК ДатаОкончания,
		|	ЗаданиеНаРаботуРаботы.Трудоемкость КАК ДлительностьВЧасах,
		|	ЗаданиеНаРаботуРаботы.Цена,
		|	ЗаданиеНаРаботуРаботы.Сумма КАК Сумма,
		|	ЗаданиеНаРаботуРаботы.Комментарий КАК ОписаниеЗадания
		|ИЗ
		|	Документ.ЗаданиеНаРаботу.Работы КАК ЗаданиеНаРаботуРаботы
		|ГДЕ
		|	ЗаданиеНаРаботуРаботы.Ссылка = &ТекущийДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаданиеНаРаботуРаботы.ДатаНачала,
		|	НомерСтроки";
		
		//@skip-check query-in-loop
		РезультатЗапроса	= Запрос.ВыполнитьПакет();
		Шапка 				= РезультатЗапроса[0].Выбрать();
		Шапка.Следующий();
		
		ВыборкаРаботы 		= РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаданиеНаРаботу_УнифицированнаяФорма";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаданиеНаРаботу.ПФ_MXL_Задание");
		
		ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
		ОбластьШапкаТаблицы	= Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьДетали		= Макет.ПолучитьОбласть("Детали");
		ОбластьИтого		= Макет.ПолучитьОбласть("Итого");
		ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
		
		ОбластьШапка.Параметры.Заполнить(Шапка);
		
		ОбластьШапка.Параметры.НомерДата = СтрШаблон(НСтр("ru = '№ %1 от %2'"), Шапка.Номер, Формат(Шапка.Дата,
			"ДЛФ=DD"));
		
		СведенияОбОрганизации = ПечатьДокументовУНФ.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата, , );
		ОбластьШапка.Параметры.ПредставлениеОрганизации = ПечатьДокументовУНФ.ОписаниеОрганизации(
			СведенияОбОрганизации, "НаименованиеДляПечати,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийЗаданиеНаРаботу.Внешнее Тогда
			ОбластьШапкаТаблицы.Параметры.ТекстВидаЗадания = НСтр("ru = 'Задание является внешним'");
		Иначе
			ОбластьШапкаТаблицы.Параметры.ТекстВидаЗадания = НСтр("ru = 'Задание является внутренним'");
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ИтогТрудоемкость = 0;
		
		Пока ВыборкаРаботы.Следующий() Цикл
			
			ОбластьДетали.Параметры.Заполнить(ВыборкаРаботы);
			ОбластьДетали.Параметры.Начало = Формат(ВыборкаРаботы.ДатаНачала, "ДФ='dd.MM.yyyy  HH:mm'");
			ОбластьДетали.Параметры.Окончание = Формат(ВыборкаРаботы.ДатаОкончания, "ДФ='dd.MM.yyyy  HH:mm'");
			
			// Если вид работ выведен в ТЧ тогда сформируем описание 
			Если Шапка.ПоложениеВидаРабот = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти Тогда
				ОбластьДетали.Параметры.ОписаниеЗадания = СтрШаблон("[%1] %2", ВыборкаРаботы.ВидРабот,
					ВыборкаРаботы.ОписаниеЗадания);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьДетали);
			ИтогТрудоемкость = ИтогТрудоемкость + ВыборкаРаботы.ДлительностьВЧасах;
			
		КонецЦикла;
	
		ОбластьИтого.Параметры.Заполнить(Шапка);
		ОбластьИтого.Параметры.ДлительностьВЧасах = ИтогТрудоемкость;
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		ОбластьПодвал.Параметры.РасшифровкаОтветственного = ?(ЗначениеЗаполнено(Шапка.Должность), Строка(
			Шапка.Должность) + ", ", "") + Строка(Шапка.Сотрудник);
		ОбластьПодвал.Параметры.РасшифровкаПодписиМОЛ = ?(ЗначениеЗаполнено(Шапка.ДолжностьМОЛ), Строка(
			Шапка.ДолжностьМОЛ) + ", ", "") + Строка(Шапка.РасшифровкаПодписиМОЛ);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

#КонецОбласти

#КонецЕсли
